<?php

$lng = array(
	'mod_name' => 'Пользователи',
	'mod_name_cp' => 'Система пользователей',
	'need_install' => 'Требуется установка',
	'avatar' => 'Аватар',
	'not_found_users' => 'Пользователи не найдены',
	'user_not_found' => 'Пользователь не найден',
	'in' => 'в',
	'search_input_ph' => 'Начните вводить логин пользователя',
	'message' => 'Сообщение',
	'comments' => 'Комментарии',
	'add_comment' => 'Добавление комментария',
	'added_by_user' => 'Добавлено пользователем',
	'com_msg_empty' => 'Не заполнено поле комментария',
	'com_wait' => 'Для повторного добовления комментария необходимо подождать',
	'com_wait1' => 'сек.',
	'com_not_found' => 'Комментарий не найден',
	'log_com_add' => 'Добавление комментария в профиле пользователя',
	'com_add_success' => 'Комментарий успешно добавлен',
	'com_del_success' => 'Комментарий успешно удален',
	'user_profile' => 'Просмотр пользователя',
	'use_comments' => 'Использовать комментарии',
	'users_on_page' => 'Пользователей на страницу',
	'comments_on_page' => 'Комментариев на страницу',
	'set_e_cfg_save' => 'Ошибка сохранения настроек',
	'set_save_success' => 'Настройки успешно сохранены',
	'log_set_main_save' => 'Сохранение настроек модуля пользователей',
);

?>