INSERT INTO `mcr_news_cats` (`title`, `description`, `data`)
VALUES
  ('О сайте', 'Категория с новостями о сайте', '{"time_create":1005553535,"time_last":1005553535,"user":"admin"}'),
  ('Важные новости', 'Новости, которые несут в себе важную информацию', '{"time_create":1005553535,"time_last":1005553535,"user":"admin"}'),
  ('Конкурсы', 'Проведение конкуцрсов, акций', '{"time_create":1005553535,"time_last":1005553535,"user":"admin"}'),
  ('Праздничные новости', 'Новости, посвящённые праздникам', '{"time_create":1005553535,"time_last":1005553535,"user":"admin"}')
;