<?php
/**
 * Copyright (c) 2018.
 * MagicMCR является отдельным и независимым продуктом.
 * Исходный код распространяется под лицензией GNU General Public License v3.0.
 *
 * MagicMCR не является копией оригинального движка WebMCR, а лишь его подверсией.
 * Разработка MagicMCR производится исключительно в частных интересах. Разработчики, а также лица,
 * участвующие в разработке и поддержке, не несут ответственности за проблемы, возникшие с движком.
 */

/**
 * Created in JM Organization.
 *
 * @e-mail: admin@jm-org.net
 * @Author: Magicmen
 *
 * @Date  : 28.07.2018
 * @Time  : 18:02
 *
 * -------------  !!! ВНИМАНИЕ !!!  -------------
 * Редактирование данного файла не приведёт к изменению настроек сайта.
 * Редактируя данный файл, вы теряете возможность получить поддержку по движку.
 *
 * В данном файле собрены настройки сайта по умолчанию.
 */

if (!defined("MCR")) exit;

return [

	/*
	|--------------------------------------------------------------------------
	| Главная группа настроек сайта.
	|--------------------------------------------------------------------------
	|
	*/
	'main' => [

		/*
		|--------------------------------------------------------------------------
		| Базовый путь к сайту.
		|--------------------------------------------------------------------------
		|
		| Ваш базовый путь к сайту. Будет вставлен в тег <base>.
		|
		*/
		'site_base_full_url' => 'http://127.0.0.1/',
		'site_base_url' => '/',

		/*
		|--------------------------------------------------------------------------
		| Информация о сайте.
		|--------------------------------------------------------------------------
		|
		| Информация о вашем сайте (SEO).
		|
		| Имя сайта, его описание и ключивые слова.
		| Необходим для индексирования в сети и др.
		|
		*/
		'site_name' => 'MagicMCR',
		'site_description' => 'Система управления сайтом',
		'site_keywords' => 'Minecraft, webmcr, Magicmen, magicmcr, сервер, Qexy',

		/*
		|--------------------------------------------------------------------------
		| Страница сайта по умолчанию.
		|--------------------------------------------------------------------------
		|
		| Должен содержать имя модуля,
		| который необходимо загружать по умолчанию.
		|
		*/
		'site_default_page' => 'news',

		/*
		|--------------------------------------------------------------------------
		| Тема сайта.
		|--------------------------------------------------------------------------
		|
		| Имя папки в директории themes/
		| Если выбранная тема не найденна, то будет
		| использована тема default.
		|
		| В случае, если тема default не была найденна - ...
		| Leave building...
		|
		*/
		'site_theme' => 'default',

		/*
		|--------------------------------------------------------------------------
		| Локаль сайта.
		|--------------------------------------------------------------------------
		|
		| locale-id
		| Должна соотевтсвовать шаблону [a-z]{2}-[A_Z]{2}.
		|
		*/
		'site_locale' => 'ru-RU',


		/*
		|--------------------------------------------------------------------------
		| Подтвержение регистрации.
		|--------------------------------------------------------------------------
		|
		| Если включено, то пользователю будет
		| приходит песьмо с требованием подтверждения email.
		|
		*/
		'require_registration_email_accept' => true,


		/*
		|--------------------------------------------------------------------------
		| Капча.
		|--------------------------------------------------------------------------
		|
		| Указывает на то, какой поставщик капчи необходимо использовать.
		| Доступные значения: re_captcha_driver, keycaptcha_driver
		| Также другие значения, если данный драйвер установлен.
		|
		| Ключи капчи: public, private
		|
		*/
		'captcha' => 're_captcha_driver',
		'captcha_public_key' => null,
		'captcha_private_key' => null,


		/*
		|--------------------------------------------------------------------------
		| Плащи.
		|--------------------------------------------------------------------------
		|
		| Если включено, то пользователям будет доступна загрузка hd плащей.
		| Влияет на hdd (+/-).
		|
		*/
		'hd_cloaks_enabled' => false

	],

	/*
	|--------------------------------------------------------------------------
	| Группа настроек пагинации.
	|--------------------------------------------------------------------------
	|
	| Указывает сколько необходимо выводить эллементов на странице,
	| для каждого нижеперечисленного
	|
	*/
	'pagination' => [

		/*
		|--------------------------------------------------------------------------
		| Стрелки.
		|--------------------------------------------------------------------------
		|
		*/
		'arrows' => 2,


		/*
		|--------------------------------------------------------------------------
		| Новости.
		|--------------------------------------------------------------------------
		|
		*/
		'news' => 10,

		/*
		|--------------------------------------------------------------------------
		| Комментарии.
		|--------------------------------------------------------------------------
		|
		*/
		'comments' => 10,


		/*
		|--------------------------------------------------------------------------
		| Результаты поиска.
		|--------------------------------------------------------------------------
		|
		*/
		'search_news' => 10,
		'search_comments' => 10,

		/*
		|--------------------------------------------------------------------------
		| Администрирование новостей.
		|--------------------------------------------------------------------------
		|
		*/
		'adm_news' => 10,
		'adm_news_cats' => 10,
		'adm_news_views' => 10,
		'adm_news_votes' => 10,

		/*
		|--------------------------------------------------------------------------
		| Администрирование коментариев.
		|--------------------------------------------------------------------------
		|
		*/
		'adm_comments' => 10,

		/*
		|--------------------------------------------------------------------------
		| Управление меню.
		|--------------------------------------------------------------------------
		|
		*/
		'adm_menu' => 10,
		'adm_menu_adm' => 10,
		'adm_menu_groups' => 10,
		'adm_menu_icons' => 10,

		/*
		|--------------------------------------------------------------------------
		| Мониторинг.
		|--------------------------------------------------------------------------
		|
		*/
		'adm_monitoring' => 10,

		/*
		|--------------------------------------------------------------------------
		| Управление пользователями.
		|--------------------------------------------------------------------------
		|
		*/
		'adm_users' => 10,
		'adm_groups' => 10,
		'adm_permissions' => 10,

		/*
		|--------------------------------------------------------------------------
		| Статические страници.
		|--------------------------------------------------------------------------
		|
		*/
		'adm_statics' => 10,

		/*
		|--------------------------------------------------------------------------
		| Просмотр логов действий пользователей.
		|--------------------------------------------------------------------------
		|
		*/
		'adm_logs' => 10,
	],

	/*
	|--------------------------------------------------------------------------
	| Компоненты. Группа с настройками компонентов CMS (блоки, модули).
	|--------------------------------------------------------------------------
	|
	| Содержин настройки, для загрузки модулей,
	| какие модули включены и прочее.
	|
	*/
	'components' => [

		/*
		|--------------------------------------------------------------------------
		| Список включённых модулей.
		|--------------------------------------------------------------------------
		|
		| Масив, который хранит набор включённых модулей.
		| Модуль выключен, если его нет в этом масиве.
		|
		*/
		'enabled_modules' => [
			'ajax',
			'auth',
			'close',
			'file',
			'logout',
			'news',
			'profile',
			'register',
			'restore',
			'search',
			'statics',
			'users',
		],

		/*
		|--------------------------------------------------------------------------
		| Включённые блоки.
		|--------------------------------------------------------------------------
		|
		| Содержит набор блоков, которые будут отображатся (включены).
		| Блок выключен, если его нет в данном списке.
		|
		*/
		'enabled_blocks' => [
			'block_banner',
			'block_monitoring',
			'block_notify',
			'block_online',
			'block_profile',
		],

	],

	'mail' => [

		'from' => 'from@site.ru',
		'from_name' => 'MagicMCR',

		'reply' => 'reply@site.ru',
		'reply_name' => 'MagicMCR',

		'cc' => false,

		'smtp' => false,
		'smtp_host' => '',
		'smtp_user' => 'admin@site.ru',
		'smtp_pass' => '',
		'smtp_tls' => false,

	],

	/*
	|--------------------------------------------------------------------------
	| Вспомогательный функционал сайта.
	|--------------------------------------------------------------------------
	|
	*/
	'functions' => [

		/*
		|--------------------------------------------------------------------------
		| Советы.
		|--------------------------------------------------------------------------
		|
		| Включает/выключает вывод советов на сайте.
		|
		*/
		'advice' => true,

		/*
		|--------------------------------------------------------------------------
		| Хлебные крошки.
		|--------------------------------------------------------------------------
		|
		*/
		'breadcrumbs' => true,

		/*
		|--------------------------------------------------------------------------
		| Доступ к сайту.
		|--------------------------------------------------------------------------
		|
		| Если включено, то сайт находится в режиме "under construction".
		| ---
		| Время до конца режима under construction.
		|
		*/
		'close' => false,
		'close_time' => 0,

		/*
		|--------------------------------------------------------------------------
		| Лимит по регистрации с одного ip-адресса.
		|--------------------------------------------------------------------------
		|
		*/
		'ip_registration_limit' => 1,

		/*
		|--------------------------------------------------------------------------
		| Белый список ip-адрессов.
		|--------------------------------------------------------------------------
		|
		*/
		'whitelist' => '',

	],

];